-- index 란?
-- SQL 구문의 성능을 좌우하는 기능이다.

/*
	100만명의 users 테이블 중 홍길동이라는 사람을 찾아야 한다.
    데이터베이스는 데이터를 조회할 때 첫번째 행부터 마지막 행까지 하나씩 비교를 하면서 스캔을 하게 된다.
    이를 full table scan 이라고 한다.
    
    index 는 목차라는 뜻도 포함하고 있다.
    데이터베이스에서 인덱스 표현은 0 부터 시작하는 숫자체계가 아닌 목차의 뜻을 가지게 된다.
    
    특정 컬럼의 값과 해당 데이터의 물리적 위치를 미리 목차 형태로 만들어서 저장을 해둔다.
    이렇게 저장을 해두면, 쿼리 실행 시 목차를 통해 원하는 데이터 위치로 즉시 이동하여 검색 속도의 향상이 일어나게 된다.
    
    index 는 양날의 검. trade-off
    
    index 단점
    1. 저장 공간 비용
    인덱스는 테이블 데이터와 별도의 공간을 차지하는 데이터 구조체 이다.
    따라서 인덱스를 많이 만들수록 전체 용량은 커진다.
    ex) 목차 10~20 page
    2. DML(INSERT , UPDATE , DELETE) 성능 저하
    가장 중요한 요인
    인덱스는 SELECT 의 성능은 향상 시키지만, 데이터 변경 작업 성능은 저하시킨다.

	insert : 새로운 데이터 추가 시, 인덱스 테이블에도 정렬된 위치를 찾아 새로운 항목을 추가해야 함.
	delete : 테이블에서 데이터 삭제 시, 인덱스 테이블에서도 해당 항목을 찾아 삭제해야 함.
	update : 만약 인덱스가 걸린 컬럼의 값이 수정되면 최악의 상황이 발생한다.
	기존 데이터를 삭제하고, 새로운 데이터를 다시 정렬된 위치에 삽입하는 작업이 모두 필요하다. (삭제 + 삽입 작업 동시 발생)
    
    index 적용 대상 선정
    1. 조회 비율이 압도적으로 높은 테이블
    - dml 작업에서 지연이 발생하더라도 감수한다.
    2. dml 중에서도 수정이 빈번하게 발생하지 않는 컬럼
*/

-- 쿼리문의 실행 계획을 확인하는 explain
explain select * from users where name = '홍길동';

-- 인덱스 생성법 : crate index 인덱스이름 on 테이블명(적용할 컬럼명)
create index udx_users_name on users(name);

-- 인덱스 적용 전 : 120 row 를 full scan 했다.
-- 인덱스 적용 후 : 1개의 row 만 scan 했다.
explain select * from users where name = '홍길동';

-- pk, unique 제약 조건이 걸린 컬럼은 데이터의 유일성이 보장되기 때문에 테이블 생성 시 자동으로 index 가 적용이 된다.